package by.ld.unit02.main;

public class FirstTask2 {

	/*
	 * Составить программу сравнения двух чисел 1 и 2.
	 * Если 1 меньше 2 – вывести на экран слово «yes», в противном случае – слово «no» .
	 * 
	 */
	public static void main(String[] args) {
       int number1, number2;
		
		number1=3;
		number2=9;
		
		if (number1<number2) {
			System.out.println("yes");
		} else {
			System.out.println("no");
		}

	}

}
