package by.ld.unit02.main;

public class FirstTask {
	/*
	 * Составить программу сравнения двух чисел 1 и 2. 
	 * Если 1 меньше 2 – вывести на экран цифру 7, в противном случае – цифру 8. 
	 */

	public static void main(String[] args) {
		int number1, number2;
		
		number1=11;
		number2=9;
		
		if (number1<number2) {
			System.out.println("7");
		} else {
			System.out.println("8");
		}

    }
}
