package by.ld.unit01.main;

public class Fifth {
	/*
	 *5. Напишите программу вычисления суммы четырёх слагаемых.
	 */

	public static void main(String[] args) {
		int a=1;
		int b=2;
		int c=3;
		int d=4;
		int sum=0;
		
		sum=a+b+c+d;
		
		System.out.println("Sum="+sum);

	}

}
