package by.ld.unit01.main;

public class Task07 {
	/*
	 * 7. Дан прямоугольник, ширина которого в два раза меньше длины. Найти площадь прямоугольника.
	 */

	public static void main(String[] args) {
		double x=5, y=2*x, z=x*y;
						
		System.out.println("Площадь прямоугольника со шириной "+x+" и длиной "+y+" равна: " +z);
		
	}

}
