package by.ld.unit01.main;

public class Third {
	/*
	 * Выведите на экран следующий текст. 
* "Пройдет много лет, и полковник Аурелиано Буэндиа, стоя у стены 
* в ожидании расстрела, вспомнит тот далекий вечер, когда отец взял его с 
* собой посмотреть на лед. Макондо было тогда небольшим селением с двумя десятками хижин, 
* выстроенных из глины и бамбука на берегу реки, которая мчала свои прозрачные воды … "
	 */

	public static void main(String[] args) {
		System.out.println("   Пройдет много лет, и полковник Аурелиано Буэндиа, \n"
				+ "стоя у стены в ожидании расстрела, вспомнит тот далекий вечер, \n"
				+ "когда отец взял его с собой посмотреть на лед. Макондо было тогда небольшим селением \n"
				+ "с двумя десятками хижин, выстроенных из глины и бамбука на берегу реки, которая мчала \n"
				+ "свои прозрачные воды …");

	}

}
